#pragma once


//----------------------------------------------------------------------------------
//	Include
//----------------------------------------------------------------------------------

#include "Fwd.h"


//----------------------------------------------------------------------------------
//	Class
//----------------------------------------------------------------------------------

namespace Game
{
namespace Util
{
	// コンソールの操作
	// リリースビルド時は無効
	class Console
	{
	public:
		// コンソールウィンドウを作成する
		static bool Create();
		// コンソールウィンドウに書き込む
		static bool Write( const std::wstring &str );
		static bool WriteLine( const std::wstring &str );
		// コンソールを破棄する
		static bool Delete();
	};
}
}