#pragma once


//----------------------------------------------------------------------------------
//	Include
//----------------------------------------------------------------------------------

#include "Util/Consts.h"


//----------------------------------------------------------------------------------
//	Class
//----------------------------------------------------------------------------------

namespace Defs
{
namespace Util
{
	class Consts
	{
	public:
		// 画面のサイズ
		static const Selene::Point2DI SCREEN_SIZE;
		// STG画面の情報表示領域のサイズ
		static const Selene::Point2DI STG_INFAREA_SIZE;
	};
}
}